{
  "user": {
    "title": "My account",
    "intro": "Manage your local account, backups, and security settings.",
    "items": {
      "userId": {
        "title": "User ID",
        "desc": "Your unique identifier on this device."
      },
      "backup": {
        "title": "Backup",
        "desc": "Choose a save location, set and confirm a backup PIN, then store the file safely. You can restore it later via the import/restore option."
      },
      "changePin": {
        "title": "Change PIN",
        "desc": "Set a new PIN for this user on this device."
      },
      "resetKeys": {
        "title": "Reset security keys",
        "desc": "Generates new keys used to encrypt your messages and clears chat history."
      },
      "delete": {
        "title": "Delete user",
        "desc": "Remove this user and all local data."
      }
    }
  },
  "profile": {
    "title": "My profile",
    "intro": "Your profile is stored locally and used only for your own content. You can optionally share it with contacts.",
    "items": {
      "name": {
        "title": "Display name",
        "desc": "Shown only on your own messages, comments, and notes on this device."
      },
      "avatar": {
        "title": "Profile picture",
        "desc": "Choose an image from your device or Unsplash; the avatar stays local unless you share it with contacts."
      },
      "style": {
        "title": "Default style",
        "desc": "Choose the font style used for your messages, comments, notes, and more."
      }
    }
  },
  "systemMessages": {
    "title": "System messages",
    "intro": "System messages keep you informed about moderation and system events. Tap a message to see details.",
    "items": {
      "inbox": {
        "title": "Inbox",
        "desc": "Shows all system messages; unread ones are highlighted."
      },
      "filters": {
        "title": "Filters",
        "desc": "Switch between unread, read, and all."
      },
      "details": {
        "title": "Details",
        "desc": "Open a message to view case info, reason, content type, and timestamp."
      },
      "actions": {
        "title": "Actions",
        "desc": "Mark as read/unread, delete a message, or open the case status link when available."
      },
      "deleteAll": {
        "title": "Delete all",
        "desc": "Removes all messages in the current list."
      }
    }
  }
}
